suppaman80/Domoriky_Esp_System/ESP8266_Gateway_mqtt/MqttHandler.cpp
    // Topic unico per invio lista nodi e status updates
    String topic = String(mqtt_topic_prefix) + "/nodo/status";
    mqttClient.publish(topic.c_str(), peerResponse.c_str());
}

void sendGatewayHeartbeat() {
    unsigned long currentTime = millis();
    
    // Crea JSON per il heartbeat del gateway (aumentato buffer a 2048 bytes per evitare troncamenti)
    DynamicJsonDocument gatewayHeartbeatDoc(2048);
    gatewayHeartbeatDoc["command"] = "GATEWAY_HEARTBEAT";
    gatewayHeartbeatDoc["gatewayId"] = gateway_id;
    gatewayHeartbeatDoc["mac"] = WiFi.macAddress();
    gatewayHeartbeatDoc["status"] = "ALIVE";
    gatewayHeartbeatDoc["timestamp"] = currentTime;
    gatewayHeartbeatDoc["uptime"] = currentTime;
    gatewayHeartbeatDoc["freeHeap"] = ESP.getFreeHeap();
    gatewayHeartbeatDoc["wifiRSSI"] = WiFi.RSSI();
    gatewayHeartbeatDoc["peerCount"] = peerCount;
    
    // Aggiungi Versione Firmware
    gatewayHeartbeatDoc["version"] = FIRMWARE_VERSION;
    gatewayHeartbeatDoc["buildDate"] = String(BUILD_DATE) + " " + String(BUILD_TIME);
    
    // Aggiungi IP del gateway
    gatewayHeartbeatDoc["ip"] = WiFi.localIP().toString();
    
    // Aggiungi informazioni rete
    gatewayHeartbeatDoc["modalita_rete"] = network_mode;
    
    // Aggiungi informazioni peer (semplificato)
    JsonObject peerInfo = gatewayHeartbeatDoc.createNestedObject("peer");
    peerInfo["registrati"] = peerCount;
    peerInfo["massimo"] = MAX_PEERS;
    
    // Conta nodi online
    int onlineCount = 0;
    for (int i = 0; i < peerCount; i++) {
        if (peerList[i].isOnline) {
            onlineCount++;
        }
    }
    peerInfo["online"] = onlineCount;
    
    // Aggiungi informazioni MQTT
    JsonObject mqttInfo = gatewayHeartbeatDoc.createNestedObject("mqtt");
    mqttInfo["server"] = String(mqtt_server) + ":" + String(mqtt_port);
    mqttInfo["connected"] = mqttClient.connected();
    
    String heartbeatOutput;
    serializeJson(gatewayHeartbeatDoc, heartbeatOutput);
    
    // Topic unificato per status del gateway
    String topic = String(mqtt_topic_prefix) + "/gateway/status";
    
    // Pubblica sul topic unificato del gateway (RETAINED = true per persistenza stato)
    if (mqttClient.connected() && mqttClient.publish(topic.c_str(), heartbeatOutput.c_str(), true)) {
        DevLog.printf("Heartbeat gateway inviato al topic: %s\n", topic.c_str());
        // DevLog.println(heartbeatOutput); // Risparmia log
    } else {
        DevLog.println("Errore invio heartbeat gateway");
    }
}

void sendDashboardDiscovery() {
    if (!mqttClient.connected()) {
        DevLog.println("❌ Cannot send discovery: MQTT not connected");
        return;
    }
    String dashboardDiscoveryTopic = String(mqtt_topic_prefix) + "/dashboard/discovery";
    mqttClient.publish(dashboardDiscoveryTopic.c_str(), "{\"command\":\"DISCOVER\"}");
    DevLog.printf("📡 Manual Dashboard Discovery sent to: %s\n", dashboardDiscoveryTopic.c_str());
}

void performOTA(String url) {
    DevLog.println("Avvio OTA Update da: " + url);
    publishGatewayStatus("ota_start", "Starting OTA update from " + url, "OTA_UPDATE");
    
    // Assicura che il messaggio MQTT venga inviato prima di bloccare tutto
    mqttClient.loop();
    delay(200);
    mqttClient.loop();
    
    // Usa un client WiFi dedicato per l'aggiornamento per non interferire con MQTT
    WiFiClient updateClient;

    // Disabilita interrupts/watchdogs se necessario, ma ESPhttpUpdate gestisce molto da solo.
    ESPhttpUpdate.setLedPin(LED_BUILTIN, LOW); 
    
    // Importante: usare updateClient separato
    t_httpUpdate_return ret = ESPhttpUpdate.update(updateClient, url);

    switch (ret) {
        case HTTP_UPDATE_FAILED:
            DevLog.printf("HTTP_UPDATE_FAILED Error (%d): %s\n", ESPhttpUpdate.getLastError(), ESPhttpUpdate.getLastErrorString().c_str());
            publishGatewayStatus("ota_failed", "Error: " + ESPhttpUpdate.getLastErrorString(), "OTA_UPDATE");
            break;

        case HTTP_UPDATE_NO_UPDATES:
            DevLog.println("HTTP_UPDATE_NO_UPDATES");
            publishGatewayStatus("ota_no_updates", "No updates found", "OTA_UPDATE");
            break;

        case HTTP_UPDATE_OK:
            DevLog.println("HTTP_UPDATE_OK");
            publishGatewayStatus("ota_success", "Update successful, rebooting...", "OTA_UPDATE");
            break;
    }
}

void processMqttCommand(const String& msgStr) {
    DevLog.print("RICEVUTO - MQTT Command: ");
    DevLog.println(msgStr);

    // Variabile per tracciare se il comando è stato gestito
    bool commandHandled = false;

    // Parsing JSON per la nuova struttura semplificata
    DynamicJsonDocument doc(512);
    DeserializationError parseError = deserializeJson(doc, msgStr);
    
    if (parseError) {
        DevLog.println("Errore parsing JSON");
        publishGatewayStatus("error", "Invalid JSON format");
        return;
    }
    
    // Comandi per il GATEWAY - Struttura: {"command": "PING_NETWORK"}
    String command = "";
    if (doc.containsKey("command")) {
        command = doc["command"].as<String>();
    } else if (doc.containsKey("Command")) {
        command = doc["Command"].as<String>();
    }
    
    if (command.length() > 0) {
        
        DevLog.printf("Comando per GATEWAY - Command: %s\n", command.c_str());

        // Comando OTA_UPDATE
        if (command == "OTA_UPDATE") {
            DevLog.println("--- COMMAND: OTA_UPDATE RECEIVED ---");
            
            // Verifica che il comando sia per questo gateway specifico
            if (doc.containsKey("gatewayId")) {
                String targetId = doc["gatewayId"].as<String>();
                DevLog.printf("Target Gateway ID: %s (My ID: %s)\n", targetId.c_str(), gateway_id);
                
                if (targetId != String(gateway_id)) {
                    DevLog.println("Ignored: Command not for me.");
                    return; 
                }
            } else {
                DevLog.println("Warning: No gatewayId in command, proceeding anyway (broadcast?)");
            }

