suppaman80/Domoriky_Esp_System/ESP8266_Gateway_mqtt/MqttHandler.cpp
        // Comando CLEANUP_OFFLINE_PEERS - Rimuove tutti i peer offline
        if (command == "CLEANUP_OFFLINE_PEERS") {
            DevLog.println("RICEVUTO - Comando: CLEANUP_OFFLINE_PEERS");
            
            int offlineCount = 0;
            int totalCount = peerCount;
            
            // Conta i peer offline e crea lista temporanea
            for (int i = 0; i < peerCount; i++) {
                if (!peerList[i].isOnline) {
                    offlineCount++;
                }
            }
            
            if (offlineCount > 0) {
                DevLog.print("Trovati ");
                DevLog.print(offlineCount);
                DevLog.println(" peer offline da rimuovere");
                
                // Rimuove i peer offline spostando i peer online all'inizio
                int newPeerCount = 0;
                for (int i = 0; i < peerCount; i++) {
                    if (peerList[i].isOnline) {
                        // Copia peer online nella nuova posizione
                        if (i != newPeerCount) {
                            memcpy(&peerList[newPeerCount], &peerList[i], sizeof(Peer));
                        }
                        newPeerCount++;
                    } else {
                        // Log rimozione peer offline
                        DevLog.print("Rimosso peer offline: ");
                        DevLog.println(peerList[i].nodeId);
                    }
                }
                
                peerCount = newPeerCount;
                
                // Salva la lista aggiornata
                savePeersToLittleFS();
                
                DevLog.print("Cleanup completato: rimossi ");
                DevLog.print(offlineCount);
                DevLog.print(" peer, rimasti ");
                DevLog.println(peerCount);
                
            } else {
                // Nessun peer offline da rimuovere
                DevLog.println("Nessun peer offline da rimuovere");
            }
            
            commandHandled = true;
            return;
        }
        
        // Comando RESTART con formato JSON
        if (command == "RESTART") {
            DevLog.println("RICEVUTO - Comando: RESTART");
            
            // Verifica gatewayId se specificato
            if (doc.containsKey("gatewayId")) {
                String targetGatewayId = doc["gatewayId"].as<String>();
                if (targetGatewayId != String(gateway_id)) {
                    return; // Ignora silenziosamente se gatewayId diverso
                }
            }
            
            // Disconnetti MQTT
            mqttClient.disconnect();
            mqttConnected = false;
            
            DevLog.println("Restarting ESP8266...");
            delay(1000);
            
            // Riavvia l'ESP8266 senza resettare la configurazione
            ESP.restart();
            commandHandled = true;
            return;
        }
        
        // Comando NETWORK_DISCOVERY con formato JSON
        if (command == "NETWORK_DISCOVERY") {
            DevLog.println("RICEVUTO - Comando: NETWORK_DISCOVERY");
            
            // 1. Invia IMMEDIATAMENTE la configurazione a HA per tutti i nodi noti
            // Questo allinea il comportamento a quello dell'avvio (onMqttConnect)
            int refreshed = 0;

            // Ensure Gateway Availability is ONLINE (Critical for HA Discovery availability_topic)
            String gatewayAvailTopic = String(mqtt_topic_prefix) + "/gateway/availability";
            mqttClient.publish(gatewayAvailTopic.c_str(), "online", true);

            for (int i = 0; i < peerCount; i++) {
                mqttClient.loop(); // Keep connection alive

                // Publish Config (Discovery) - Force RESET to ensure HA picks it up
                HaDiscovery::publishDiscovery(mqttClient, peerList[i], mqtt_topic_prefix, true);
                HaDiscovery::publishDashboardConfig(mqttClient, peerList[i], mqtt_topic_prefix);
                
                // Publish Status and Availability
                publishPeerStatus(i, "FORCE_DISCOVERY"); 
                
                // Force Availability to ONLINE explicitly
                String availTopic = String(mqtt_topic_prefix) + "/nodo/" + String(peerList[i].nodeId) + "/availability";
                mqttClient.publish(availTopic.c_str(), "online", true);

                refreshed++;
            }
            DevLog.printf("Discovery MQTT: Refreshed %d known peers immediately\n", refreshed);

            // 2. Invia richiesta di discovery broadcast per trovare nuovi nodi o risvegliare quelli esistenti
            uint8_t broadcastAddress[] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
            espNow.send(broadcastAddress, "GATEWAY", "DISCOVERY", "DISCOVERY", "REQUEST", "DISCOVERY", gateway_id);
            
            // Imposta flag per inviare lista aggiornata dopo timeout
            networkDiscoveryActive = true;
            networkDiscoveryStartTime = millis();
            
            commandHandled = true;
            return;
        }
        
        // Comando PING_NETWORK - Invia PING individualmente a tutti i nodi online
        if (command == "PING_NETWORK") {
            DevLog.println("RICEVUTO - Comando: PING_NETWORK");
            
            int nodesSent = 0;
            String pingedNodesStr = "[";
            
            if (peerCount > 0) {
                // Resetta lo stato delle risposte
                memset(pingResponseReceived, 0, sizeof(pingResponseReceived));
                
                // Invia comando PING individualmente a TUTTI i nodi nella lista
                for (int i = 0; i < peerCount; i++) {
                    // Salva il MAC del nodo pingato usando l'indice corretto
                    memcpy(pingedNodesMac[i], peerList[i].mac, 6);
                    pingResponseReceived[i] = false;
                    
                    // Invia comando PING al nodo specifico
                    espNow.send(peerList[i].mac, peerList[i].nodeId, "CONTROL", "PING", "REQUEST", "COMMAND", gateway_id);
                    
