suppaman80/Domoriky_Esp_System/ESP8266_Gateway_mqtt/MqttHandler.cpp
                    // Aggiungi ID nodo alla lista stringa (più leggero di JSON object completo)
                    if (nodesSent > 0) pingedNodesStr += ",";
                    pingedNodesStr += "\"" + String(peerList[i].nodeId) + "\"";
                    
                    nodesSent++;
                    
                    // Piccolo delay tra un invio e l'altro per evitare sovraccarico
                    delay(10);
                }
                
                // Avvia il processo di attesa risposte
                pingNetworkActive = true;
                pingNetworkStartTime = millis();
                pingResponseCount = peerCount; 
            }
            pingedNodesStr += "]";
            
            // Costruisci JSON manualmente per risparmiare RAM (evita DynamicJsonDocument 2KB)
            String responseOutput = "{";
            responseOutput += "\"command\":\"PING_NETWORK\",";
            responseOutput += "\"timestamp\":" + String(millis()) + ",";
            responseOutput += "\"total_nodes\":" + String(peerCount) + ",";
            responseOutput += "\"nodes_sent\":" + String(nodesSent) + ",";
            responseOutput += "\"result\":\"" + String(nodesSent > 0 ? "success" : "no_nodes") + "\",";
            responseOutput += "\"pinged_nodes\":" + pingedNodesStr;
            responseOutput += "}";
            
            // Pubblica report iniziale
            String topic = String(mqtt_topic_prefix) + "/gateway/status";
            mqttClient.publish(topic.c_str(), responseOutput.c_str());
            
            commandHandled = true;
            return;
        }
    }
}
